import 'package:flutter/cupertino.dart';
import 'package:khulasa/Models/article.dart';

// ignore: camel_case_types
class articleprovider extends ChangeNotifier {
  catprovider() {
    getarticleList();
    notifyListeners();
  }

  final List<article> _article = [
    article(
        title: "سنسنی سے بھرپور گروپ مرحلے کے میچ بہت یاد آئیں گے",
        summary:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        content:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        category: "sports"),
    article(
        title: "سنسنی سے بھرپور گروپ مرحلے کے میچ بہت یاد آئیں گے",
        summary:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        content:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        category: "sports"),
    article(
        title: "سنسنی سے بھرپور گروپ مرحلے کے میچ بہت یاد آئیں گے",
        summary:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        content:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        category: "sports"),
    article(
        title: "سنسنی سے بھرپور گروپ مرحلے کے میچ بہت یاد آئیں گے",
        summary:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        content:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        category: "sports"),
    article(
        title: "سنسنی سے بھرپور گروپ مرحلے کے میچ بہت یاد آئیں گے",
        summary:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        content:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        category: "sports"),
    article(
        title: "سنسنی سے بھرپور گروپ مرحلے کے میچ بہت یاد آئیں گے",
        summary:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        content:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        category: "sports"),
    article(
        title: "سنسنی سے بھرپور گروپ مرحلے کے میچ بہت یاد آئیں گے",
        summary:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        content:
            "ہر روز ایسا لگتا ہے کہ اب اس سے زیادہ ڈراما کیا ہوسکتا ہے لیکن ہر دن فیفا ورلڈ کپ مجھے غلط ثابت کررہا ہے۔",
        category: "sports"),
  ];

  List<article> getarticleList() {
    return _article;
  } //update later

  int get count => _article.length;
  String gettitle(int i) => _article[i].title;
  String getcontent(int i) => _article[i].content;
  String getsummary(int i) => _article[i].summary;
  String getcategory(int i) => _article[i].category;
}
